Revit 2026 API

# SweptBlendTopProfileSymbol Property

---

The top family symbol profile of the swept blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbolProfile TopProfileSymbol { get; }
```
```vb
Public ReadOnly Property TopProfileSymbol As FamilySymbolProfile
	Get
```
```cpp
public:
property FamilySymbolProfile^ TopProfileSymbol {
	FamilySymbolProfile^ get ();
}
```
```fsharp
member TopProfileSymbol : FamilySymbolProfile with get
```

#### Property Value

FamilySymbolProfile

If the top profile is sketch-based, this property is .

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace